**Add a new column called "Rank_in_Subject" that ranks students within their subject based on their marks (highest marks â†’ rank 1).**

In [1]:
import pandas as pd  

data = {
    "Name": ["Ali", "Sara", "John", "Mary", "Alex"],
    "Subject": ["Math", "Science", "Math", "Science", "Math"],
    "Marks": [85, 92, 78, 88, 95]
}

df = pd.DataFrame(data)
df

   Name  Subject  Marks
0   Ali     Math     85
1  Sara  Science     92
2  John     Math     78
3  Mary  Science     88
4  Alex     Math     95

In [4]:
df["Rank_in_Subject"] = df.groupby("Subject")["Marks"].rank(ascending=False)

In [9]:
df["Rank_in_Subject"] = df["Rank_in_Subject"].astype(int)

In [10]:
df

   Name  Subject  Marks  Rank_in_Subject
0   Ali     Math     85                2
1  Sara  Science     92                1
2  John     Math     78                3
3  Mary  Science     88                2
4  Alex     Math     95                1